In [5]:
import pandas as pd
import numpy as np

dados = {
    'NOME':['Pedro','Maria','Janaina','Wong','Roberto','Marco', 'Paula'],
    'CIDADE':['Porto Alegre','São Paulo','Rio de Janeiro','Brasília','Salvador','Curitiba','Belo Horizonte'],
    'IDADE':[14,13,15,16,18,13,14],
    'NOTA':[83.0,59.0,86.0,89.0,98.0,61.0,44.0],
    }
dfAlunos = pd.DataFrame(data=dados)

dfAlunos

      NOME          CIDADE  IDADE  NOTA
0    Pedro    Porto Alegre     14  83.0
1    Maria       São Paulo     13  59.0
2  Janaina  Rio de Janeiro     15  86.0
3     Wong        Brasília     16  89.0
4  Roberto        Salvador     18  98.0
5    Marco        Curitiba     13  61.0
6    Paula  Belo Horizonte     14  44.0